Revit 2027 API
IntersectionResult.Distance Property
Distance from the original object to located point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Distance { get; }
Public ReadOnly Property Distance As Double
	Get
public:
property double Distance {
	double get ();
}
member Distance : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace